[
    {
        "business_name": "",
        "address": "",
        "phone": "",
        "about": "",
        "website": "",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/miracle-complete-auto-care-dallas-173370?store=255663"
    },
    {
        "business_name": "JJS ELVES",
        "address": "Serving Dallas, TX",
        "phone": "4697010955",
        "about": " JJ's Elves are here, bringing holiday cheer! We specialize in holiday lighting installations in Dallas, Fort Worth and the surrounding communities. Stress less this holiday season with help from JJ's Elves. Print our coupon and save when you schedule service today and let us start \"hanging at your house\" soon. Share Visit Website",
        "website": "https://holidaylightscompany.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/JJsElves/"
            },
            {
                "Instagram": "https://www.instagram.com/jjselves/"
            }
        ],
        "email": "mailto:info@holidaylightscompany.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/jjs-elves-181818?store=90117"
    },
    {
        "business_name": "PREMIERE LUX CINE & PIZZA PUB",
        "address": "510 E Westchester Pkwy\nGrand Prairie, TX 75052",
        "phone": "9722993456",
        "about": " Looking for some first date ideas or want to just go have a fun night with friends? We've got the perfect place for you! Come to Grand Prairie Premiere LUX 10 & Pizza Pub on Westchester Pkwy in Grand Prairie, TX. Sit back, relax & enjoy a slice of pizza with a cocktail as you watch your flick. Share Visit Website",
        "website": "https://www.pccmovies.com/location/44486/Grand-Prairie-PREMIERE-LUX-10-and-Pizza-Pub",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/GPPremiereLuxCine/"
            }
        ],
        "email": "mailto:guestrelations@pccmovies.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/premiere-lux-cine-pizza-pub-145472?store=223282"
    },
    {
        "business_name": "FIRST GLANCE VISION - SACHSE",
        "address": "8015 Woodbridge Pkwy\nSachse, TX 75048",
        "phone": "9724294859",
        "about": " Anyone can easily see that vision is an important asset to everything they do. But we tend to neglect our eyes, more than any other body part. Get on the path to healthy eyes for a lifetime with routine visits to First Glance Vision in Sachse, Texas. We're helping you clearly see the advantages to having your eyes checked by using our coupons for a free exam. Visit our site location and see us soon. Share Visit Website",
        "website": "http://www.firstglancevision.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/FirstGlanceSachse/"
            }
        ],
        "email": "mailto:firstglanceng@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/first-glance-vision-sachse-186743?store=272337"
    },
    {
        "business_name": "CHUBBY'S FAMILY RESTAURANT - DALLAS",
        "address": "11331 E Northwest Hwy\nDallas, TX 75238",
        "phone": "2143486065",
        "about": "Plenty of menu choices and hearty portions of homemade American foods for breakfast, lunch and dinner at Chubby's Family Restaurant in Dallas, TX. We're currently offering a coupon for meal savings, so take advantage of the best meals that tastes like Grandma made them. Chubby's has two convenient locations in Dallas, so you're sure to be close to one of them at: 7474 South Cockrell Hill Road or 11331 East Northwest Highway. Come in and save tonight.",
        "website": "http://www.eatatchubbys.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/chubbys-family-restaurant-dallas-180391?store=267162"
    },
    {
        "business_name": "TOTAL NUTRITION",
        "address": "5706 E Mockingbird Ln\nDallas, TX 75206",
        "phone": "4693340006",
        "about": " At Total Nutrition in Dallas, Texas, we sell products for your overall health and wellness, sports nutrition, weight loss supplements, vitamins and more. Visit our website and see our product line of CBD products, too, that are legal in all 50 states. Whether you want to gain muscle or lose fat, your ultimate goal should be for greater health benefits and maximum wellness. Come in and talk with us and allow us to assist you on your way to a successful fitness lifestyle. Share Visit Website",
        "website": "http://totalnutritionmockingbird.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/TNMockingbird/"
            },
            {
                "Twitter": "http://www.twitter.com/TNMockingbird_"
            },
            {
                "Instagram": "https://www.instagram.com/total.nutrition.mockingbird/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/total-nutrition-190147?store=275835"
    },
    {
        "business_name": "PARKWAY CAR WASH",
        "address": "4206 S Carrier Pkwy\nGrand Prairie, TX 75052",
        "phone": "9726423545",
        "about": "At Parkway Car Wash, you can choose anything from our quick drive-through car wash to a hand car wash to auto detailing. We are dedicated to providing our clients with an unforgettable experience regardless of the degree of work you request. You will find our local car wash in Grand Prairie, TX right on South Carrier Parkway near Walgreens, Western Union and CVS. Redeem the provided car wash specials to save on service today!",
        "website": "https://parkwaycarwashes.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/parkwaycarwashtx/"
            }
        ],
        "email": "mailto:parkway@parkwaycarwashes.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/parkway-car-wash-127546?store=267186"
    },
    {
        "business_name": "DRY CLEAN CITY / CASA VIEW CLEANERS",
        "address": "2323 Gus Thomasson Rd\nDallas, TX 75228",
        "phone": "2143201176",
        "about": " To get a professional and polished look, try taking your dress shirts, men's trousers and ladies suits to Casa View Cleaners/Dry Clean City in Dallas, TX. We're offering coupons for a limited time so you can save on the cost of looking great. We specialize in wedding gown preservation, silk clothing, leather and suede, too. Redeem our coupons to get the best deals on dry cleaning. Share",
        "website": "",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/DryCleanCityFarmersBranch/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/dry-clean-city-casa-view-cleaners-138951?store=215676"
    },
    {
        "business_name": "KWIK KAR LUBE & TUNE - HAMPTON",
        "address": "8551 S Hampton Rd\nDallas, TX 75232",
        "phone": "9725725945",
        "about": "Print an oil change coupon and save today with Kwik Kar Lube and Tune in Dallas, TX. At Kwik Kar, we provide full service for foreign and domestic vehicles. We are your local automotive shop for quality vehicle repair, service and maintenance. We do it all with the best service at affordable prices. We value serving customers in order to help them maintain the safe operation and economic value of their vehicles. At Kwik Kar in Dallas, we'll help you travel with peace of mind. Save with our printable car repair coupons.",
        "website": "https://kwikkaronline.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/KwikkarDallas/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/kwik-kar-lube-tune-hampton-120118?store=267141"
    },
    {
        "business_name": "BARBECUE AT HOME BY DICKEY'S",
        "address": "4514 Cole Avenue Suite 1015\nDallas, TX 75205",
        "phone": "8179142897",
        "about": " Yes! The very same Dickey's that you have known, loved and frequented for decades now offers Barbecue At Home by Dickey's in Dallas, TX. Our delicious sausages are a mix of traditional and non-traditional flavors made in small batches by hand. Texas Brisket Beef Chili, Smoked Brisket Burnt Ends, Hickory Smoked Pork Belly or just order a Fall Fest Box and get them all. See our website & order for the holidays or make any day a jolly day of Chef curated products from Dickey's. Print our coupon for big savings for a limited time. Share Visit Website",
        "website": "http://barbecueathome.com/",
        "social_links": [
            {
                "Facebook": "https://facebook.com/dickeysathome"
            },
            {
                "Instagram": "https://instagram.com/dickeysathome"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/barbecue-at-home-by-dickeys-190137?store=275819"
    },
    {
        "business_name": "THE COLONY CAFE",
        "address": "4750 South Colony Boulevard#120,\nThe Colony, TX 75056",
        "phone": "2144078303",
        "about": " Families love the mouthwatering meals we're servin' up daily here at The Colony Cafe. Locals know that we're one of the best restaurants in The Colony, TX and we uphold that reputation by routinely offering consistent quality & service. Try any of many breakfast foods like waffles, crepes, French toast or Mexican tacos, quesadillas and burritos. Burgers, wraps and sandwiches will fuel your afternoon. Stop in today and save on hearty homestyle cooking. Share Visit Website",
        "website": "https://colonycafe.hrpos.heartland.us/menu",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/the-colony-cafe-188189?store=273832"
    },
    {
        "business_name": "SPECTRUM BUSINESS",
        "address": "Serving Dallas, TX",
        "phone": "8773570930",
        "about": "Bottlenecks – they make highway traffic nightmarish, they cripple the production of an assembly line, they slow down computer processing power and they can slow down the way you do business. Avoid bottlenecks. Go with Spectrum Business for lightning-fast Internet, crystal-clear phone and full HD TV service. Make the switch to Spectrum Business today and leave bottlenecks behind. Contact us today and be sure to redeem the offers on this page.",
        "website": "",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/spectrum-business-153297?store=92072"
    },
    {
        "business_name": "RED HOT & BLUE",
        "address": "9143 Grapevine Hwy\nNorth Richland Hills, TX 76180",
        "phone": "8176051333",
        "about": "DINE-IN | CARRY OUT | DELIVERY | CONVENIENT CURBSIDE | CATERING",
        "website": "http://www.redhotandblue.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/red-hot-blue-178087?store=261319"
    },
    {
        "business_name": "SOLAR SOLUTIONS OF AMERICA",
        "address": "Serving Dallas, TX",
        "phone": "8882041175",
        "about": " Share Visit Website",
        "website": "http://www.solarsolutionsofamerica.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/pages/category/Solar-Energy-Company/Solar-Solutions-of-America-103788001325640/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/solar-solutions-of-america-178526?store=79123"
    },
    {
        "business_name": "SANDY LAKE DENTAL & ORTHODONTICS **NE**",
        "address": "120 S. Denton Tap Road\nCOPPELL, TX 75019",
        "phone": "9723937348",
        "about": " Enjoy the convenience that is provided by a multi-specialty practice by becoming a patient at Sandy Lake Dental & Orthodontics in Coppell, TX. From teeth whitening to Invisalign to tooth extractions, Sandy Lake Dental & Orthodontics is ready to treat each member of your family with a variety of oral care services. Look at our displayed dental discounts & current offers, then give us a call! Share Visit Website",
        "website": "http://www.sandylakedentistry.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/SandyLakeDental/?ref=page_internal"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/sandy-lake-dental-orthodontics-ne-186766?store=94255"
    },
    {
        "business_name": "ALL PRO GARAGE DOORS",
        "address": "Serving Dallas, TX",
        "phone": "4697442381",
        "about": " America’s choice for superior overhead door sales and Dallas’ #1 choice is, All Pro Garage Doors. We provide garage door installation, routine maintenance, tune-ups, replacement overhead doors and new overhead door openers for residential and commercial projects in the DFW, Highland Village and Lewisville areas. We also offer discount prices to fit every budget. As garage door repair specialists, we can replace loose cables, broken cables, broken panels and more. See us about Genie, Liftmaster, Sears and most other overhead doors or overhead garage door openers. We also carry and deliver many garage door remotes and many other hard to find garage door accessories. Visit us online for more about our services and redeem our coupons for savings. Share Visit Website",
        "website": "http://www.apgaragedoors.com/",
        "social_links": [],
        "email": "mailto:apgaragedoors@yahoo.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/all-pro-garage-doors-112283?store=91371"
    },
    {
        "business_name": "SMOOTHIE KING - TEXAS",
        "address": "755 Grapevine Hwy\nHurst, TX 76054",
        "phone": "8177884612",
        "about": " When you're craving the best smoothie recipes out there, there's nowhere else to go but Smoothie King! Cut costs on your next mouthwatering menu pick by redeeming a Smoothie King coupon at Smoothie King in Watauga, Southlake or Hurst, TX. Staying healthy has never tasted so good! Share Visit Website",
        "website": "https://www.smoothieking.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/SmoothieKing/"
            },
            {
                "Instagram": "https://www.instagram.com/smoothieking/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/smoothie-king-texas-182395?store=267095"
    },
    {
        "business_name": "FLOOR N MORE - LEWISVILLE",
        "address": "1844 N Stemmons Fwy\nLewisville, TX 75067",
        "phone": "9728630247",
        "about": "Do you live in or around Dallas, Fort Worth, Lewisville, Southlake, Rockwall or Haltom City, TX? Then you're not far from Floro N More! We are thrilled to introduce our kitchen and floor visualizer. Check it out by clicking here! At Floor N More, we will beat any written estimate guaranteed on hardwood, engineered wood, laminate, carpet, natural stone, porcelain tile, ceramic tile, granite countertop and any available flooring product. Choose from a variety of tile, granite, travertine and marble countertops for your kitchen, bar or bathroom remodel. From consultations to unique product sourcing to installation services, we are dedicated to delivering meticulous quality and satisfaction.Don't feel like driving? Let us bring our showroom to you! Call our toll-free number or Click Here to schedule your free in-home consultation and estimate.",
        "website": "http://www.floornmore.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/FloorNMore1/"
            },
            {
                "Twitter": "https://twitter.com/floornmore"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/floor-n-more-lewisville-167099?store=247641"
    },
    {
        "business_name": "ADT HOME SECURITY",
        "address": "Serving Dallas, TX",
        "phone": "8447091743",
        "about": "You deserve peace of mind. You deserve to feel protected. You deserve to be confident in your level of home safety. Once you or your family's well-being has been jeopardized, it can be tough to restore a true sense of safety. Don't take that chance. Get protection today to feel safe tomorrow.",
        "website": "http://adtspecials.com/vpnov",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/adt-home-security-185541?store=91472"
    },
    {
        "business_name": "ORANGE THEORY FITNESS",
        "address": "18101 Preston Rd, 105\nDallas, TX 75252",
        "phone": "9728467519",
        "about": " The work you do in the gym, doesn't just stop here. The benefits continue to help improve your heart rate and burn more calories because it works from the inside out. At Orange Theory Fitness in Frisco, Texas, we'll focus on training for endurance, power and strength and you'll derive continuous benefits outside the studio to tell you that your workout is working out for you. Print our coupon for instant savings now. Share Visit Website",
        "website": "http://www.orangetheory.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/OrangetheoryFitness/"
            },
            {
                "Twitter": "https://twitter.com/orangetheory"
            },
            {
                "Instagram": "https://www.instagram.com/orangetheory/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/orange-theory-fitness-188843?store=274396"
    },
    {
        "business_name": "SUPERCUTS",
        "address": "9160 N Tarrant Pkwy\nNorth Richland Hills, TX 76182",
        "phone": "8175762009",
        "about": " High fade or long layers? Classic or contemporary? At Supercuts in Fort Worth, Texas, we'll talk it over with you so you get the haircut or hairstyle you want. While you're here, ask your hairstylist how to keep your \"look\" between visits and learn about Redken. Print our coupons and save on the cost of looking great! Share Visit Website",
        "website": "http://www.supercuts.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/Supercuts/"
            },
            {
                "Twitter": "https://twitter.com/supercuts"
            },
            {
                "Instagram": "https://www.instagram.com/supercuts/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/supercuts-189052?store=274594"
    },
    {
        "business_name": "HOT NAILS & SPA",
        "address": "4201 W. GREEN OAKS BLVD. #356\nARLINGTON, TX 76016",
        "phone": "8174783032",
        "about": "The safety and wellbeing of our guests, our team and the loved ones you all share your lives with are of the highest importance to us. Please know we are adding extra precautions to our long-practiced sanitation efforts for your safety! We feature shields at every station and masks & gloves are worn for the safety of our guests and team.",
        "website": "http://hotnailspaarlington.com/about-us",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/hot-nails-spa-34659?store=95076"
    },
    {
        "business_name": "SUPERCUTS",
        "address": "832 W University Dr\nDenton, TX 76201",
        "phone": "9403834356",
        "about": " High fade or long layers? Classic or contemporary? At Supercuts in Fort Worth, Texas, we'll talk it over with you so you get the haircut or hairstyle you want. While you're here, ask your hairstylist how to keep your \"look\" between visits and learn about Redken. Print our coupons and save on the cost of looking great! Share Visit Website",
        "website": "http://www.supercuts.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/Supercuts/"
            },
            {
                "Twitter": "https://twitter.com/supercuts"
            },
            {
                "Instagram": "https://www.instagram.com/supercuts/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/supercuts-189052?store=274591"
    },
    {
        "business_name": "IVY AIR LLC",
        "address": "1317 Red Hawk Bay Dr\nQuinlan, TX 75474",
        "phone": "9729559640",
        "about": " Call Ivy Air LLC for residential & commercial HVAC repair & services. We provide heating and air conditioning, routine maintenance and replacement installation in Quinlan and the surrounding vicinity of Edgewood, Wills Point & Greenville. Contact us for everything from home AC repair to bathroom exhaust fan installation to commercial freezer repair. When you want high-quality service with discount deals to help you save, choose Ivy Air. Share Visit Website",
        "website": "http://www.ivyairhvacr.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/ivyairhvacr"
            }
        ],
        "email": "mailto:management@ivyairhvacr.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/ivy-air-llc-167697?store=89092"
    },
    {
        "business_name": "GRAND PRAIRIE CHAMBER OF COMMERCE",
        "address": "2602 Mayfield Rd\nGrand Prairie, TX 75052",
        "phone": "9722641558",
        "about": "Download the GooseChase App & create your profile. Register, then spend five days scavenging around Grand Prairie, learning about the local area, hunting to complete tasks, meeting local business owners, and having a blast! Take your chance at winning the $1000 grand prize! Challenge your friends, family, and co-workers to the game, it's only $10 to play!",
        "website": "http://passport2gp.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/grandprairiechamber/"
            },
            {
                "Twitter": "https://twitter.com/gptxchamber"
            },
            {
                "Instagram": "https://www.instagram.com/gptxchamber/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/grand-prairie-chamber-of-commerce-146511?store=224709"
    },
    {
        "business_name": "POPCORN STOP",
        "address": "6401 South Cooper Street #125\nArlington, TX 76001",
        "phone": "8176816007",
        "about": "Pop into our store for loads of goodies to take home or to ship as gifts. From gourmet popped corn to specialized sodas, candy, sugar-glazed nuts and other confections, Popcorn Stop in Arlington, Texas is a sweet place for snacks and treats. Our designer popcorn tins, seasonal-themed tins and sports tins can be filled with up to 3 choices of flavored popcorn. We can also make up gift bags & specialty bags for your next event. Print our coupons and come in today.",
        "website": "http://mypopcornstop.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/popcornstop/"
            },
            {
                "Twitter": "https://twitter.com/popcornstop"
            },
            {
                "Instagram": "https://www.instagram.com/mypopcornstop/"
            }
        ],
        "email": "mailto:popcornstop@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/popcorn-stop-189466?store=274974"
    },
    {
        "business_name": "ORANGE THEORY FITNESS",
        "address": "7039 Walnut Hill Ln, 165\nDallas, TX 75230",
        "phone": "4693332718",
        "about": " The work you do in the gym, doesn't just stop here. The benefits continue to help improve your heart rate and burn more calories because it works from the inside out. At Orange Theory Fitness in Frisco, Texas, we'll focus on training for endurance, power and strength and you'll derive continuous benefits outside the studio to tell you that your workout is working out for you. Print our coupon for instant savings now. Share Visit Website",
        "website": "http://www.orangetheory.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/OrangetheoryFitness/"
            },
            {
                "Twitter": "https://twitter.com/orangetheory"
            },
            {
                "Instagram": "https://www.instagram.com/orangetheory/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/orange-theory-fitness-188843?store=274397"
    },
    {
        "business_name": "PLATINUM PAINTING",
        "address": "FORT WORTH",
        "phone": "8174423781",
        "about": " Share Visit Website",
        "website": "http://www.platinumpainting.com/",
        "social_links": [
            {
                "Facebook": "http://www.facebook.com/platinumpaintingDFW/"
            }
        ],
        "email": "mailto:office@platinumpainting.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/platinum-painting-83235?store=92068"
    },
    {
        "business_name": "KOLACHE FACTORY - MURPHY",
        "address": "601 E FM 544, SUITE 100\nMurphy, TX 75094",
        "phone": "9724426622",
        "about": "Print a kolache coupon and save today at Kolache Factory in Murphy, TX & Richardson, TX. Our own kolaches are made with freshest ingredients, old world recipes and the precision of our master bakers. Put it all together and you have a modern variation of the pastry roll that originated in Eastern Europe centuries ago. In addition to serving many varieties of kolaches, customers can also enjoy gourmet coffees and a variety of traditional pastries such as cinnamon rolls, croissants, strudel and other delicious treats. Our company is as unique as the products we serve. Use our coupons and try our fresh-baked goods today. ",
        "website": "http://www.kolachefactory.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/kolachefactory"
            },
            {
                "Twitter": "https://twitter.com/kolachefactory"
            },
            {
                "Instagram": "https://www.instagram.com/kolachefactory/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/kolache-factory-murphy-118531?store=267175"
    },
    {
        "business_name": "GAYLORD TEXAN (DALLAS)",
        "address": "1501 Gaylord Trl\nGrapevine, TX 76051",
        "phone": "6154586271",
        "about": " There is no better way to celebrate Christmas than gathering with family at Gaylord Texan in Dallas. There are dozens of activities and fun for all ages including photos with Santa and of course all the Christmas lights, shows, and displays. Go on a mission to save Christmas with Buddy the Elf or try snow tubing and the Ice Adventure. If you're feeling creative, stop in the Build-A-Bear workshop or decorate gingerbread, build your own snowman, or go ice skating. Delight the kids when you take part in special meal events like Breakfast with Charlie Brown & Friends. There's something for everyone at Gaylord Texan. Visit the website or call to reserve your room and tickets. Share Visit Website",
        "website": "http://www.christmasatgaylordtexan.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/GaylordTexanResort/"
            },
            {
                "Twitter": "https://twitter.com/GaylordTexan"
            },
            {
                "Instagram": "https://www.instagram.com/gaylordtexan/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/gaylord-texan-dallas-190251?store=275964"
    },
    {
        "business_name": "ROTO-ROOTER PLUMBING & WATER CLEANUP DALLAS",
        "address": "Roto-Rooter Plumbing & Water Cleanup in Dallas",
        "phone": "9729861978",
        "about": "Call Roto-Rooter in Dallas when you need plumbing repair or water cleanup services. We offer 24-hour emergency service with no extra charge for plumbing or drain cleaning services at night, on weekends or holidays, plus we provide FREE estimates.\n\nRoto-Rooter has reliably served homeowners since 1935 and in Dallas is known for honest, professional emergency service. Our uniformed, badged, licensed and insured plumbers and technicians will fix your kitchen or bathroom plumbing, clogged drain, toilet repair, burst pipe, water heater repair and every other plumbing repair service -- fast. And, we will professionally clean up all types of water problems.\n\nNobody does it better or faster than Roto-Rooter. So call us when you need any plumbing and water cleanup services. Yeah, we do both.",
        "website": "https://www.rotorooter.com/Dallas",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/RotoRooterDallasTX"
            },
            {
                "Twitter": "https://twitter.com/RotoRooter"
            },
            {
                "Instagram": "https://www.instagram.com/rotorooterplumbing/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/roto-rooter-plumbing-water-cleanup-dallas-184229?store=85295"
    },
    {
        "business_name": "THE JOINT CHIROPRACTIC - DFW",
        "address": "3005 Lakeview Pkwy\nRowlett, TX 75088",
        "phone": "9724750025",
        "about": "No need to social distance because you're in so much pain! Get relief from muscle aches, old athletic injuries in joints or misaligned bones. At The Joint Chiropractic in Rowlett, TX, allow our professionals to assist with natural pain management to get you back on the path to better wellness and mobility again. Being socially distant will become nonexistent once you can move freely again.",
        "website": "https://www.thejoint.com/texas/rowlett/rowlett-28076",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/thejointrowlett/"
            },
            {
                "Twitter": "https://twitter.com/thejointchiro"
            },
            {
                "Instagram": "https://www.instagram.com/thejointchiro/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/the-joint-chiropractic-dfw-184447?store=269750"
    },
    {
        "business_name": "SANDY LAKE DENTAL & ORTHODONTICS **NE**",
        "address": "120 S. DENTON TAP ROAD\nCOPPELL, TX 75019",
        "phone": "9723937348",
        "about": " Enjoy the convenience that is provided by a multi-specialty practice by becoming a patient at Sandy Lake Dental & Orthodontics in Coppell, TX. From teeth whitening to Invisalign to tooth extractions, Sandy Lake Dental & Orthodontics is ready to treat each member of your family with a variety of oral care services. Look at our displayed dental discounts & current offers, then give us a call! Share Visit Website",
        "website": "http://www.sandylakedentistry.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/SandyLakeDental/?ref=page_internal"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/sandy-lake-dental-orthodontics-ne-186766?store=94254"
    },
    {
        "business_name": "TRIMARK 3 INSURANCE",
        "address": "2015 McKenzie Drive Suite 109\nCarrollton, TX 75006",
        "phone": "9726690175",
        "about": " Are you considering exchanging cash for your life insurance policy? Perhaps your needs have changed quickly and you need cash now for medical expenses, monthly bills, debt reduction or long term care. Contact Paul R. Lowe, Insurance Broker at TriMark3 Insurance in Carrollton, TX for a free consultation. Lets talk about your current needs and how you can get financial relief fast, should you decide to sell your life policy. Share Visit Website",
        "website": "http://trimark3.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/profile.php?id=100067174476963"
            }
        ],
        "email": "mailto:pl@trimark3.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/trimark-3-insurance-189455?store=274964"
    },
    {
        "business_name": "NATURE'S MERCANTILE + CBD STORES",
        "address": "100 Grapevine Hwy, B\nHurst, TX 76054",
        "phone": "8179532691",
        "about": " The high-quality CBD products at Nature's Mercantile + CBD Store in Hurst, TX, are 100% organic, hemp-plant-derived tinctures, topicals, capsules, skin care products, pet products and more. Many of our customers tell us they get relief from ailments, illnesses and aches and pains with CBD therapy. Our product \"The Cloud\" does not give the customer any psychoactive effect and it is legal in all 50 states. Can you benefit from CBD? Come in and talk with our knowledgeable staff to find out. Print our coupons and save on the finest products on the market today, for a limited time. Share Visit Website",
        "website": "http://naturescbdmercantile.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/naturescbdmercantile/"
            }
        ],
        "email": "mailto:naturesmercantile@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/natures-mercantile-cbd-stores-153719?store=233704"
    },
    {
        "business_name": "SMITH THOMPSON HOME SECURITY",
        "address": "Smith Thompson Home Security - Houston",
        "phone": "7134921064",
        "about": " Can you ever be too safe? That's a question to not only ask yourself, but one you should ask of Smith Thompson Home Security in Dallas & Fort Worth, TX. With over 40 years of service to DFW, our family owned and operated business can help with your current security system or a new one to update your home to the latest technology. Does one app to control cameras, door locks, lighting, garage door & more sound appealing? Call for details. Get a discount deal if you bundle our security system and pest control services. Share Visit Website",
        "website": "http://www.smiththompson.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/smith-thompson-home-security-179134?store=79645"
    },
    {
        "business_name": "INKEEZE TATTOO LIFESTYLE PRODUCTS",
        "address": "Serving Dallas, TX",
        "phone": "8888418510",
        "about": "INK-EEZE is a Tattoo product lifestyle brand. We are inspired through developing products specifically for the tattoo industry by collaborating with tattoo artists, collectors and skin care professionals. Since day one, we have tirelessly worked to foster a culture of quality at an affordable price. Our products speak to a new generation of people and artists alike who are passionate about their tattoos and protecting them. We have tested this product rigorously and are proud to offer it to you. ",
        "website": "http://www.inkeeze.com/",
        "social_links": [
            {
                "Facebook": "http://www.facebook.com/inkeezetattoocare"
            },
            {
                "Twitter": "http://twitter.com/inkeeze"
            },
            {
                "GooglePlus": "http://plus.google.com/116583869449735500750"
            },
            {
                "Instagram": "http://www.instagram.com/inkeeze/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/inkeeze-tattoo-lifestyle-products-137109?store=83663"
    },
    {
        "business_name": "SHERRELL AIR CONDITIONING & HEATING",
        "address": "Sherrell Air Conditioning - Dallas",
        "phone": "9722161961",
        "about": " Share Visit Website",
        "website": "https://sherrellair.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/sherrellair/"
            },
            {
                "Instagram": "https://www.instagram.com/sherrell.air/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/sherrell-air-conditioning-heating-163826?store=91373"
    },
    {
        "business_name": "ORANGE THEORY FITNESS",
        "address": "3625 W University Dr, Ste 300\nMcKinney, TX 75071",
        "phone": "9726164088",
        "about": " The work you do in the gym, doesn't just stop here. The benefits continue to help improve your heart rate and burn more calories because it works from the inside out. At Orange Theory Fitness in Frisco, Texas, we'll focus on training for endurance, power and strength and you'll derive continuous benefits outside the studio to tell you that your workout is working out for you. Print our coupon for instant savings now. Share Visit Website",
        "website": "http://www.orangetheory.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/OrangetheoryFitness/"
            },
            {
                "Twitter": "https://twitter.com/orangetheory"
            },
            {
                "Instagram": "https://www.instagram.com/orangetheory/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/orange-theory-fitness-188843?store=274394"
    },
    {
        "business_name": "LIVING H20 CAR WASH",
        "address": "15209 Addison Rd\nAddison, TX 75001",
        "phone": "9729600333",
        "about": " Our car wash cares about the community we reside in and beyond. We donate a portion of every wash to a charitable organization (supporting women, children, military, first responders, local schools & outreach). Drive on down to Living H2O Car Wash for a Cause in Addison, TX today. Save on select full service or exterior car wash, any detail or express service and other car care services. Use our displayed car wash coupons to get the best deals, while helping fellow citizens live a better life. Share Visit Website",
        "website": "http://livingh2ocarwash.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/BigOsAutoWash"
            },
            {
                "Instagram": "https://www.instagram.com/bigosautowash/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/living-h20-car-wash-184572?store=269867"
    },
    {
        "business_name": "THE ANGEL PLAN",
        "address": "269 E Ovilla Rd, Ste 100\nRed Oak, TX 75154",
        "phone": "4699493499",
        "about": " Affordable healthcare? Is there really something available that meets the immediate needs of patients? There is now that you've found The Angel Plan in Red Oak, Texas. See our website for information on primary care, cardiology, telemedicine, discount labs and imaging, hormone therapy and more. Print our coupons for additional savings on our already low costs. Share Visit Website",
        "website": "http://theangelplan.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/login/?next=https%3A%2F%2Fwww.facebook.com%2FTheAngelPlan%2F"
            },
            {
                "Twitter": "https://twitter.com/TheAngelPlan1"
            },
            {
                "Instagram": "https://www.instagram.com/theangelplan/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/the-angel-plan-188197?store=273835"
    },
    {
        "business_name": "CHAMPION EXPRESS LUBE - DESOTO",
        "address": "1822 N Hampton Rd\nDesoto, TX 75115",
        "phone": "9722241187",
        "about": " Prioritizing automotive maintenance is the best way to ensure the longevity of your vehicle. Having a preventable breakdown feels terrible - let the professionals at Champion Xpress Lube in Desoto, TX help you prevent unnecessary calamity. Our ASE certified auto repair technicians work hard to serve our community with top-notch auto services in our state-of-the-art auto garage. Before you stop by for an oil change in Desoto, TX or other car maintenance services, be sure to look through the featured auto service specials to enjoy our savings. Share Visit Website",
        "website": "http://championexpresslube.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/ChampionXpress/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/champion-express-lube-desoto-169772?store=267159"
    },
    {
        "business_name": "DRY CLEAN SUPER CENTER -NOOR",
        "address": "485 S. DENTON TAP RD.\nCOPPELL, TX 75019",
        "phone": "9724627459",
        "about": "We are 100% Green at Dry Clean Super Center. We love our customers and that's why we do not use Perc.  Green dry cleaning is safter for you & better for your clothes and the enviornment.  Same day service available.  Be sure to redeem our printable coupon online for savings on dry cleaning. ",
        "website": "",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/dry-clean-super-center-noor-112253?store=83219"
    },
    {
        "business_name": "SNIDER PLAZA ANTIQUES, ART, JEWELRY & POSTAL",
        "address": "3419 Westminster Ave\nDallas, TX 75205",
        "phone": "2148088160",
        "about": "Shopping has never been more convenient. Visit Snider Plaza Antiques, Snider Plaza Postal & William Sheahan Designs in Dallas, TX today. Snider Plaza Antiques offers furniture, artwork, home decor and much more. At Snider Plaza Postal, you can handle all your packaging, shipping and printing needs. William Sheahan Designs provides custom jewelry services, jewelry sales & consignment and watch/jewelry repair. We're the perfect place to come for an eclectic mix of beautiful gift items and you can get them gift wrapped, packaged and shipped, on the spot!",
        "website": "http://www.sniderplazaantiques.co/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/SniderPlazaAntiques/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/snider-plaza-antiques-art-jewelry-postal-181745?store=267595"
    },
    {
        "business_name": "MANSFIELD PLUMBING",
        "address": "1285 N Main St, Ste 101\nMansfield, TX 76063",
        "phone": "8174738888",
        "about": "Mansfield Plumbing in the Greater Mansfield/Arlington, TX area is a community leader. We have experience in handling a wide range of installation & repair needs, and we offer 24-hour emergency service. In addition, we also can handle both residential and commercial plumbing needs! At Mansfield Plumbing, we pride ourselves on quality service, affordable rates, and friendly and professional technicians. Our customers have voted us \"Plumber of the Year\" from 2011-2015 in the Mansfield News Mirror. Give Us A Call Today and Let Us Show You Why.",
        "website": "http://www.mansfieldtxplumbing.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/Mansfieldtxplumbing/?fref=ts"
            }
        ],
        "email": "mailto:Mansfieldplumbing@yahoo.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/mansfield-plumbing-130324?store=95208"
    },
    {
        "business_name": "MUSTANG CAR WASH",
        "address": "2125 IRA E. WOODS AVE.(HWY 26)\nGRAPEVINE, TX 76051",
        "phone": "8174421663",
        "about": " At Mustang Elite Car Wash located in Grapevine, TX, our team of friendly and professional wash associates promise to deliver a sparkling clean vehicle inside and out every time. Whether you select our Basic Wash, full detailing or any other service, we are committed to helping you protect and preserve the appearance of your vehicle. We're the place to visit for oil changes, new air filter or Texas state inspection. Our Lube Center experts can change your oil or fluids while you wait! Share Visit Website",
        "website": "http://www.mustangelitecarwash.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/mustang-car-wash-41920?store=94590"
    },
    {
        "business_name": "MR. JIM'S PIZZA- S. CARROLLTON",
        "address": "2150 N Josey Ln, 238\nCarrollton, TX 75006",
        "phone": "9724469926",
        "about": " Order pizza online or call now for special savings! MrJims.Pizza of South Carrollton is known for having the best pizza crust. Our hand-stretched pizza dough is made fresh daily from flour containing 100% spring wheat. Our Orignal™ style pizzas have more fresh toppings than any of our competitors and you can unleash your own creativity with our Build Your Own Pizza option. Don't wait any longer to enjoy our premier specialty pizza pies bursting with flavor. Be sure to try our fresh salads, Italian pasta dishes, chicken wings and other fantastic menu items, too. Share Visit Website",
        "website": "https://www.mrjims.pizza/076.cfm",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/MrJimsPizza-76-Carrollton-TX-335966744633/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/mr-jims-pizza-s-carrollton-91703?store=267184"
    },
    {
        "business_name": "INTEGRITY 1ST AUTO - PLANO",
        "address": "3330 Independence Pkwy, 300\nPlano, TX 75023",
        "phone": "4696063436",
        "about": "We deliver high-quality car care without the high costs here at Integrity 1st Automotive. We are a local Texan-owned family operation with over two decades of experience and convenient automotive shops located in Plano, TX & Wylie, TX. Be sure to continue checking this page for updated oil change coupons & more! When you choose Integrity 1st Automotive, you can rest easy knowing our work is performed by ASE-certified technicians and further backed by comprehensive dealership-like warranties. By sticking to our core values since day one; we have nurtured a community of loyal customers all over the region and built lasting relationships within the community.",
        "website": "https://integrity1auto.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/integrity1auto/"
            },
            {
                "Instagram": "https://www.instagram.com/integrity1auto/"
            }
        ],
        "email": "mailto:info@integrity1auto.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/integrity-1st-auto-plano-142467?store=219741"
    },
    {
        "business_name": "234 OUTDOOR",
        "address": "2600 K Ave\nPLANO, TX 75074",
        "phone": "2144314608",
        "about": "Whether you're looking to fence your property for security, safety, to keep family in or keep others out, 234 Outdoor in Dallas/Fort Worth, Texas, should be your builder of choice. From design conception to fence completion, the certified, experienced craftsmen at 234 Outdoor will use top-of-the-line Cedar materials to give you long-lasting results for a fence, deck, arbor or even an outdoor kitchen. We purchase our premium quality materials at factory direct prices, so we can pass the savings onto our customers at the lowest prices. See us first for products & services that last. Print our coupons for even more savings.",
        "website": "https://www.234outdoor.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/234Out-door-101673362130240"
            },
            {
                "GooglePlus": "https://plus.google.com/108897160492827135298/about"
            }
        ],
        "email": "mailto:jumpcode6731@yahoo.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/234-outdoor-120697?store=89090"
    },
    {
        "business_name": "SPECTRUM RESIDENTIAL",
        "address": "Serving Dallas, TX",
        "phone": "8886222770",
        "about": "If you can compare sharing your home’s internet bandwidth with rationing hot water for multiple showers, you’re probably doing it wrong – at least, your ISP is. Go with Spectrum’s residential internet service for blazing fast speeds and enough bandwidth for the gamers, the streaming, the power users and more. Kiss buffering and stuttering goodbye. Check out the offers on this page and make the switch today. ",
        "website": "",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/spectrum-residential-151438?store=92075"
    },
    {
        "business_name": "ALL TUNE AND LUBE",
        "address": "2321 W. PIONEER PKWY\nARLINGTON, TX 76013",
        "phone": "8172740500",
        "about": " Share Visit Website",
        "website": "http://www.visitalltuneandlube.com/",
        "social_links": [],
        "email": "mailto:info@alltuneandlubearlington.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/all-tune-and-lube-98359?store=94658"
    },
    {
        "business_name": "ABAR HEATING & AIR CONDITIONING, INC.",
        "address": "Serving Dallas, TX",
        "phone": "2142752227",
        "about": " At ABAR Heating & Air Conditioning, you will find insured HVAC contractors in Dallas, TX with a BBB A+ rating. We proudly service all makes & models. Enjoy free estimates (on new systems only), financing options and senior discounts. Be sure to look through our featured HVAC deals, too, affording you savings on select services or products in the Metro Dallas area. We offer both residential & commercial HVAC service. Share Visit Website",
        "website": "https://www.dallastxacinstallation.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/abar-heating-air-conditioning-inc-181491?store=83069"
    },
    {
        "business_name": "SUBURBAN PLANTS",
        "address": "1810 LA PRADA DR.\nMesquite, TX 75150",
        "phone": "2147487438",
        "about": " Save on your next purchase at Suburban Plants Garden Center in Mesquite, TX today. Suburban Plants is a proud family-owned and operated business offering quality \"from the ground up!\" We grow our plants ourselves, ensuring that they are landscaper-grade quality to provide you with the best value. Our wholesale/retail plant nursery is located about 50 miles from our Mesquite facility - ask us all about it! We have a wide selection of plants and flowers, serving both wholesale and retail customers with annuals, hanging baskets, tropicals, perennials, shrubs, vines, ground cover and trees. If we don't have it, we'll find it for you. If you're too busy to prepare the beds for your plants, we can do it for you. Suburban Plants is also happy to offer residential & commercial landscaping services, lawn service, bed preparation, seasonal color, sod, landscaping installation, tree service and so much more. Share Visit Website",
        "website": "http://www.suburbanplants.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/Suburban-Plants-694374543999941/timeline"
            }
        ],
        "email": "mailto:eric@suburbanplants.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/suburban-plants-126323?store=267201"
    },
    {
        "business_name": "ROCCO'S ITALIAN CAFE",
        "address": "908 Audelia Rd, Suite 500\nRichardson, TX 75081",
        "phone": "4698868209",
        "about": "When the perfect combination of Italian spices and herbs meets an old-world Italian sauce recipe and marries a hand-tossed crust, the result is the best tasting pizza being born at Rocco's Italian Cafe in Richardson, TX. There are also the best wings in four flavors, salads, subs, house made pasta, calzone and more on our menu. Marry up your taste buds with our Italian food and love will bloom tonight.",
        "website": "http://iloveroccospizza.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/RoccosRichardson"
            }
        ],
        "email": "mailto:roccositaliancafe@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/roccos-italian-cafe-180393?store=263878"
    },
    {
        "business_name": "TED'S FLOOR & DECOR",
        "address": "6206 Highway 78\nSachse, TX 75048",
        "phone": "9724957249",
        "about": " One of the oldest of Sachse’s businesses, Ted’s Floor & Decor has been serving & installing flooring for customers for over 40 years. This small, family-owned business since 1976, specializes in the sale and installation of residential and commercial flooring. Our showroom of fine products includes: luxury vinyl tiles, carpets, hardwoods, laminates, tiles and more. Our services also include tile showers and tile back-splashes. Visit our showcase house of extensive product samples at affordable prices. Don’t forget to print and present your flooring coupon for savings on your home improvement costs. Share Visit Website",
        "website": "http://tedsfloor.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/tedsfloor/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/teds-floor-decor-135726?store=267193"
    },
    {
        "business_name": "XIN XIAN",
        "address": "5010 N Jupiter Rd\nGarland, TX 75044",
        "phone": "9724140880",
        "about": " Save tonight when you order takeout from one of the best Garland eateries: Xin Xian Chinese Restaurant. Our authentic Asian recipes are truly mouthwatering and delectable. Make today memorable by enjoying our flavorful food for lunch or dinner. Thai curries, noodle soups, vegetarian meals and sushi specials. Save with our coupons. Share Visit Website",
        "website": "https://www.xinxianrestaurant.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/xinxian-chinese-restaurant-sushi-433639170153804/?fref=nf"
            }
        ],
        "email": "mailto:xinxianrestaurant@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/xin-xian-123720?store=267599"
    },
    {
        "business_name": "NATIONAL DEBT RELIEF",
        "address": "PAY OFF YOUR DEBT!",
        "phone": "8888664117",
        "about": "PAY OFF YOUR DEBT FOR SIGNIFICANTLY LESS THAN YOU OWE",
        "website": "http://www.nationaldebtrelief.com/getyourlifeback",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/NationalDebtRelief/?ref=page_internal"
            },
            {
                "Twitter": "https://twitter.com/nationalrelief_?lang=en"
            },
            {
                "Instagram": "https://www.instagram.com/nationaldebtrelief/?hl=en"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/national-debt-relief-188669?store=92058"
    },
    {
        "business_name": "5 STAR BATH SOLUTIONS",
        "address": "3500 E Park Blvd, 2204\nPlano, TX 75074",
        "phone": "4697078274",
        "about": " Improve your overall home value and transform your bathroom into an oasis you'll want to spend time in. Contact Five Star Bath Solutions in Plano, Texas, for shower conversions, bath remodels, bath and shower combo conversions, new showers, safety showers or walk in tubs. We have a wide-range of bath solutions for every homeowner's needs. Our certified expert craftsman will install your permanent waterproof floor-to-ceiling protection against water damage. Print coupon and give us a call for pricing options to fit every budget. Share Visit Website",
        "website": "http://www.fivestarbathsolutions.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/5-star-bath-solutions-190152?store=275840"
    },
    {
        "business_name": "JACKPOT BINGO",
        "address": "1023 Explorer St\nDuncanville, TX 75137",
        "phone": "9727801994",
        "about": " Come on down to Jackpot Bingo for real ol' fashioned bingo fun! We offer all paper games - no video. Test your luck at our local bingo hall in Duncanville, TX today. We've got big payouts and attentive staff members available to answer any of your questions. Share Visit Website",
        "website": "https://bingodfw.com/jackpot-bingo",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/jackpotbingoduncanville/"
            }
        ],
        "email": "mailto:lindabingo@gmail.com",
        "product_link": "https://www.valpak.com/local/dallas-tx/jackpot-bingo-164451?store=273174"
    },
    {
        "business_name": "ROOTER CONNECTIONZ PLUMBING & DRAIN CLEANING",
        "address": "Serving Dallas, TX",
        "phone": "2143800870",
        "about": " Share Visit Website",
        "website": "https://www.rooterconnectionz.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/rooterconnectionz/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/rooter-connectionz-plumbing-drain-cleaning-168914?store=70329"
    },
    {
        "business_name": "HOT PIZZA",
        "address": "17194 Preston Rd, 102\nDallas, TX 75248",
        "phone": "4693991461",
        "about": "Hot Pizza proudly offers dine-in, drive-thru, carryout & delivery services in Dallas, TX. We fuse Italian, Indian, and traditional Texas flavors to create memorable pizza pies the whole family will crave for days! Check out our current pizza specials to pay less for the best pizza in Dallas. Savor the flavors of Jain Masala Pizza, Chatpata Spicy Paneer Pizza, American Bites with a dash of Pickle Sprinkler, or Mexican Corn Delight. Round out your pizza feast with your favorite flavor or Jain Bread or Cheesy Bread. The website menu has details on all the wonderful flavors. Don't forget your coupon and save on your order.",
        "website": "http://hotpizzausa.menufy.com/",
        "social_links": [
            {
                "Facebook": "https://www.facebook.com/hotpizzadallas/"
            }
        ],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/hot-pizza-184294?store=269589"
    },
    {
        "business_name": "BB NAIL SPA",
        "address": "8245 Precinct Line Rd, Ste 140\nNorth Richland Hills, TX 76182",
        "phone": "8178499988",
        "about": "The safety and wellbeing of our guests, our team and the loved ones you all share your lives with are of the highest importance to us. Please know we are adding EXTRA PRECAUTION to our long practiced sanitation efforts for your safety! Shields at every station, masks and gloves for the safety of our guests and team.",
        "website": "http://bbnailspanorthrichlandhills.com/",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/bb-nail-spa-172740?store=254838"
    },
    {
        "business_name": "BUBBLE & SQUEAK CRAFT BEER",
        "address": "425 Pinson Rd\nForney, TX 75126",
        "phone": "4696884170",
        "about": " We are a full service brew store offering loads of local craft beers, many brewed in nearby neighborhoods. At Bubble & Squeak Craft Beer & Wine in Forney, TX, come in and see the wide selection of beer and wine available (some even in our red phone booth). While you're here pick up a few premium cigars, that pair perfectly with your selected brew, in front of the TV watching a ballgame. Stock up your bar while you can save with our coupons. Share Visit Website",
        "website": "https://bubble-squeak-craft-beer-and-wine.business.site/?utm_source=gmb&utm_medium=referral",
        "social_links": [],
        "email": "",
        "product_link": "https://www.valpak.com/local/dallas-tx/bubble-squeak-craft-beer-190143?store=275833"
    }
]